# **2853. Highest Salaries Difference**

**Table: Salaries**
``` console
+-------------+---------+ 
| Column Name | Type    | 
+-------------+---------+ 
| emp_name    | varchar | 
| department  | varchar | 
| salary      | int     |
+-------------+---------+
``` 
(emp_name, department) is the primary key (combination of unique values) for this table.

Each row of this table contains emp_name, department and salary. There will be at least one entry for the engineering and marketing departments.

Write a solution to calculate the difference between the highest salaries in the marketing and engineering department. Output the absolute difference in salaries.

Return the result table.

The result format is in the following example.

 

**Example 1:**

**Input:** 
**Salaries table:**
``` console
+----------+-------------+--------+
| emp_name | department  | salary |
+----------+-------------+--------+
| Kathy    | Engineering | 50000  |
| Roy      | Marketing   | 30000  |
| Charles  | Engineering | 45000  |
| Jack     | Engineering | 85000  | 
| Benjamin | Marketing   | 34000  |
| Anthony  | Marketing   | 42000  |
| Edward   | Engineering | 102000 |
| Terry    | Engineering | 44000  |
| Evelyn   | Marketing   | 53000  |
| Arthur   | Engineering | 32000  |
+----------+-------------+--------+
```
**Output:**
``` console 
+-------------------+
| salary_difference | 
+-------------------+
| 49000             | 
+-------------------+
```
**Explanation:** 
- The Engineering and Marketing departments have the highest salaries of 102,000 and 53,000, respectively. Resulting in an absolute difference of 49,000.

**Solution-1:**

``` sql
SELECT 
ABS(SUM(CASE WHEN department = 'Engineering' THEN salary
WHEN department = 'Marketing' THEN -salary ELSE 0 END)) AS salary_difference
FROM
(SELECT 
department, Max(salary) As salary
FROM Salaries
GROUP BY department)a

**Solution-2:**

``` sql
# Write your MySQL query statement below

SELECT ABS((SELECT MAX(salary) as salary FROM Salaries WHERE department = "Engineering") 
- (SELECT MAX(salary) as salary FROM Salaries WHERE department = "Marketing")) AS salary_difference

**Solution-3:**

``` sql
select abs(max( CASE WHEN department='Engineering' THEN salary  END) - max( CASE WHEN department='Marketing' THEN salary  END))as salary_difference
from Salaries